Merge pull request #48 from diandria/docs/architecture-diagrams
Docs/architecture diagrams
